[command]/home/runner/work/_temp/82a06c52-6209-4c47-9b2f-c5c87d0d7d23/terraform-bin plan -no-color
data.terraform_remote_state.backend: Reading...
data.terraform_remote_state.backend: Read complete after 0s
module.ecr.aws_ecr_repository.frontend: Refreshing state... [id=frontend]
module.ecr.data.aws_caller_identity.current: Reading...
module.ecs.aws_iam_role.frontend_task_role: Refreshing state... [id=FrontendTaskRole]
module.s3.aws_s3_bucket.frontend: Refreshing state... [id=frontend-created-bucket-789]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=976193222510]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ecr.aws_ecr_repository.frontend has been deleted
  - resource "aws_ecr_repository" "frontend" {
        id                   = "frontend"
      - name                 = "frontend" -> null
      - repository_url       = "976193222510.dkr.ecr.eu-central-1.amazonaws.com/frontend" -> null
        tags                 = {}
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_iam_role.frontend_task_role has been deleted
  - resource "aws_iam_role" "frontend_task_role" {
      - arn                   = "arn:aws:iam::976193222510:role/FrontendTaskRole" -> null
      - id                    = "FrontendTaskRole" -> null
        name                  = "FrontendTaskRole"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.s3.aws_s3_bucket.frontend has been deleted
  - resource "aws_s3_bucket" "frontend" {
      - arn                         = "arn:aws:s3:::frontend-created-bucket-789" -> null
      - bucket                      = "frontend-created-bucket-789" -> null
      - id                          = "frontend-created-bucket-789" -> null
        tags                        = {
            "Name" = "frontend-created-bucket-789"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.ecr.aws_ecr_lifecycle_policy.frontend_policy will be created
  + resource "aws_ecr_lifecycle_policy" "frontend_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Delete untagged images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 1
                          + countType   = "sinceImagePushed"
                          + countUnit   = "days"
                          + tagStatus   = "untagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "frontend"
    }

  # module.ecr.aws_ecr_repository.frontend will be created
  + resource "aws_ecr_repository" "frontend" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "frontend"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.ecr.null_resource.push_frontend will be created
  + resource "null_resource" "push_frontend" {
      + id = (known after apply)
    }

  # module.ecs.aws_iam_role.frontend_task_role will be created
  + resource "aws_iam_role" "frontend_task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "FrontendTaskRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.ecs.aws_iam_role_policy.frontend_task_policy will be created
  + resource "aws_iam_role_policy" "frontend_task_policy" {
      + id          = (known after apply)
      + name        = "frontend-task-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::frontend-created-bucket-789/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.s3.aws_s3_bucket.frontend will be created
  + resource "aws_s3_bucket" "frontend" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "frontend-created-bucket-789"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "frontend-created-bucket-789"
        }
      + tags_all                    = {
          + "Name" = "frontend-created-bucket-789"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_policy.public_read will be created
  + resource "aws_s3_bucket_policy" "public_read" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.frontend will be created
  + resource "aws_s3_bucket_public_access_block" "frontend" {
      + block_public_acls       = true
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = false
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + frontend_ecr_url = (known after apply)
  + s3_bucket_name   = "frontend-created-bucket-789"

Error: Unsupported attribute

  on main.tf line 5, in module "sg":
   5:   vpc_id      = data.terraform_remote_state.backend.outputs.vpc_id
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "vpc_id".

Error: Unsupported attribute

  on main.tf line 29, in module "lb":
  29:   vpc_id            = data.terraform_remote_state.backend.outputs.vpc_id
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "vpc_id".

Error: Unsupported attribute

  on main.tf line 30, in module "lb":
  30:   public_subnet_ids = data.terraform_remote_state.backend.outputs.public_subnet_ids
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "public_subnet_ids".

Error: Unsupported attribute

  on main.tf line 45, in module "ecs":
  45:   execution_role_arn      = data.terraform_remote_state.backend.outputs.execution_role_arn
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "execution_role_arn".

Error: Unsupported attribute

  on main.tf line 53, in module "service":
  53:   ecs_cluster_id          = data.terraform_remote_state.backend.outputs.ecs_cluster_id
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "ecs_cluster_id".

Error: Unsupported attribute

  on main.tf line 55, in module "service":
  55:   public_subnet_ids       = data.terraform_remote_state.backend.outputs.public_subnet_ids
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "public_subnet_ids".

Error: Unsupported attribute

  on main.tf line 64, in module "asg":
  64:   cluster_name          = data.terraform_remote_state.backend.outputs.cluster_name #"ECS-cluster"
    ├────────────────
    │ data.terraform_remote_state.backend.outputs is object with no attributes

This object does not have an attribute named "cluster_name".
::debug::Terraform exited with code 1.
::debug::stdout: data.terraform_remote_state.backend: Reading...%0Adata.terraform_remote_state.backend: Read complete after 0s%0Amodule.ecr.aws_ecr_repository.frontend: Refreshing state... [id=frontend]%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.ecs.aws_iam_role.frontend_task_role: Refreshing state... [id=FrontendTaskRole]%0Amodule.s3.aws_s3_bucket.frontend: Refreshing state... [id=frontend-created-bucket-789]%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=976193222510]%0A%0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.ecr.aws_ecr_repository.frontend has been deleted%0A  - resource "aws_ecr_repository" "frontend" {%0A        id                   = "frontend"%0A      - name                 = "frontend" -> null%0A      - repository_url       = "976193222510.dkr.ecr.eu-central-1.amazonaws.com/frontend" -> null%0A        tags                 = {}%0A        # (5 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role.frontend_task_role has been deleted%0A  - resource "aws_iam_role" "frontend_task_role" {%0A      - arn                   = "arn:aws:iam::976193222510:role/FrontendTaskRole" -> null%0A      - id                    = "FrontendTaskRole" -> null%0A        name                  = "FrontendTaskRole"%0A        tags                  = {}%0A        # (8 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.s3.aws_s3_bucket.frontend has been deleted%0A  - resource "aws_s3_bucket" "frontend" {%0A      - arn                         = "arn:aws:s3:::frontend-created-bucket-789" -> null%0A      - bucket                      = "frontend-created-bucket-789" -> null%0A      - id                          = "frontend-created-bucket-789" -> null%0A        tags                        = {%0A            "Name" = "frontend-created-bucket-789"%0A        }%0A        # (9 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.ecr.aws_ecr_lifecycle_policy.frontend_policy will be created%0A  + resource "aws_ecr_lifecycle_policy" "frontend_policy" {%0A      + id          = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + rules = [%0A                  + {%0A                      + action       = {%0A                          + type = "expire"%0A                        }%0A                      + description  = "Delete untagged images"%0A                      + rulePriority = 1%0A                      + selection    = {%0A                          + countNumber = 1%0A                          + countType   = "sinceImagePushed"%0A                          + countUnit   = "days"%0A                          + tagStatus   = "untagged"%0A                        }%0A                    },%0A                ]%0A            }%0A        )%0A      + registry_id = (known after apply)%0A      + repository  = "frontend"%0A    }%0A%0A  # module.ecr.aws_ecr_repository.frontend will be created%0A  + resource "aws_ecr_repository" "frontend" {%0A      + arn                  = (known after apply)%0A      + force_delete         = true%0A      + id                   = (known after apply)%0A      + image_tag_mutability = "MUTABLE"%0A      + name                 = "frontend"%0A      + registry_id          = (known after apply)%0A      + repository_url       = (known after apply)%0A      + tags_all             = (known after apply)%0A    }%0A%0A  # module.ecr.null_resource.push_frontend will be created%0A  + resource "null_resource" "push_frontend" {%0A      + id = (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role.frontend_task_role will be created%0A  + resource "aws_iam_role" "frontend_task_role" {%0A      + arn                   = (known after apply)%0A      + assume_role_policy    = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action    = "sts:AssumeRole"%0A                      + Effect    = "Allow"%0A                      + Principal = {%0A                          + Service = "ecs-tasks.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + create_date           = (known after apply)%0A      + force_detach_policies = false%0A      + id                    = (known after apply)%0A      + managed_policy_arns   = (known after apply)%0A      + max_session_duration  = 3600%0A      + name                  = "FrontendTaskRole"%0A      + name_prefix           = (known after apply)%0A      + path                  = "/"%0A      + tags_all              = (known after apply)%0A      + unique_id             = (known after apply)%0A    }%0A%0A  # module.ecs.aws_iam_role_policy.frontend_task_policy will be created%0A  + resource "aws_iam_role_policy" "frontend_task_policy" {%0A      + id          = (known after apply)%0A      + name        = "frontend-task-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "s3:GetObject",%0A                          + "s3:PutObject",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "arn:aws:s3:::frontend-created-bucket-789/*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket.frontend will be created%0A  + resource "aws_s3_bucket" "frontend" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "frontend-created-bucket-789"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = true%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Name" = "frontend-created-bucket-789"%0A        }%0A      + tags_all                    = {%0A          + "Name" = "frontend-created-bucket-789"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.public_read will be created%0A  + resource "aws_s3_bucket_policy" "public_read" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.frontend will be created%0A  + resource "aws_s3_bucket_public_access_block" "frontend" {%0A      + block_public_acls       = true%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = true%0A      + restrict_public_buckets = false%0A    }%0A%0APlan: 8 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + frontend_ecr_url = (known after apply)%0A  + s3_bucket_name   = "frontend-created-bucket-789"%0A
::debug::stderr: %0AError: Unsupported attribute%0A%0A  on main.tf line 5, in module "sg":%0A   5:   vpc_id      = data.terraform_remote_state.backend.outputs.vpc_id%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "vpc_id".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 29, in module "lb":%0A  29:   vpc_id            = data.terraform_remote_state.backend.outputs.vpc_id%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "vpc_id".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 30, in module "lb":%0A  30:   public_subnet_ids = data.terraform_remote_state.backend.outputs.public_subnet_ids%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "public_subnet_ids".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 45, in module "ecs":%0A  45:   execution_role_arn      = data.terraform_remote_state.backend.outputs.execution_role_arn%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "execution_role_arn".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 53, in module "service":%0A  53:   ecs_cluster_id          = data.terraform_remote_state.backend.outputs.ecs_cluster_id%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "ecs_cluster_id".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 55, in module "service":%0A  55:   public_subnet_ids       = data.terraform_remote_state.backend.outputs.public_subnet_ids%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "public_subnet_ids".%0A%0AError: Unsupported attribute%0A%0A  on main.tf line 64, in module "asg":%0A  64:   cluster_name          = data.terraform_remote_state.backend.outputs.cluster_name #"ECS-cluster"%0A    ├────────────────%0A    │ data.terraform_remote_state.backend.outputs is object with no attributes%0A%0AThis object does not have an attribute named "cluster_name".%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

<!-- Sticky Pull Request Comment -->